/* მოგესალმებით მეგობრებო ეს არის დავალება ნომერი 2. დავალების ყველა ეტაპი აღწერილია კომენტარის სახით
 * 1) შედარება
 * 3) If პირობები
 * 4) ლოგიკური ოპერატორები
 * 5) Switch 
 */



// <------- შედარება ---------#### //

const num1 = 0;
const boolean1 = false;
const num2 = 5;
const emptyString = "";
const boolean2 = false;
const text = "I'm Text";
const text2 = "0";

// ჩამოწერეთ ცვლადები რომელი არის true რომელი false
// ჩამოწერეთ ზეპირად!
// მაგ. [1, 2, 3, 4]

// >>> კოდი დაწერეთ აქ 

const isFalse = [ num1 , boolean1 , emptyString , boolean2  ];
const isTrue = [ num2 , text,  text2 ];

//


// შეცვალეთ ერთი ასო რომ მიიღოთ ჭეშმარიტი დებულება
// მოკლედ ახსენით მუშაობის პრინციპი თუ რატომ იმოქმედა

console.log("abc" > "ah")
console.log(2 === "004")


console.log("abc" > "aah")
console.log(2 === 002)

// პირველ დებულებაში ჩავამატე "a" რადგან სტრინგების შედარების დროს ამოწმებს 
// თანმიმდევრობით ასოებს ანბანში რიგის ნომრით რადგან პირველი ასოები (a === a)
// შემდეგ გადავა მეორე ასოზე და ამ შემთხვევაში b > a 

// მეორე დებულებაში 4 შევცვალე 2ით და პრჭყალები ჩამოვაშორე რადგან სამი = არის
// მკაცრი ტოლობა და ამოწმებს როგორც "შიგთავს" ასევე ამ შიგთავსის ტიპებს და
// 0 არ უცვლის მნიშვნელობას როცა წინ უწერია ნამბერს


// <------- ლოგიკური ოპერატორები ---------#### //

// შეამოწმეთ სრულ წლოვნებაზე და თუ მეტი ან ტოლია
// 18 წელზე შესთავაზეთ სასმელი

// >>> კოდი დაწერეთ აქ 


let age = prompt("შეიყვანე შენი ასაკი");

if( age >= 18){
    console.log("რომელ სასმელს მიირთმევ?");
}else{
    console.log("შენ არ შეგიძლია შემოსვლა");
}


//


// მოიფიქრეთ 2 if else-ის მაგალითი თქვენით

// >>> კოდი დაწერეთ აქ

let date = prompt("რომელი თვეა? ");

if( date == "მარტი" || date == "აპრილი" || date == "მაისი"){
        console.log("ახლა გაზაფხულია");
    }else if( date == "ივნისი" || date == "ივლისი" || date == "აგვისტო"){
        console.log("ახლა ზაფხულია");
            }else if( date == "სექტემბერი" || date == "ოქტომბერი" || date == "ნოემბერი"){
                 console.log("ახლა შემოდგომაა");
                     }else{
                        console.log("ახლა ზამთარია");
}




//


// გადაიყვანეთ If ternary operator-ში მაგ. (true ? 1 : 2) 

// >>> კოდი დაწერეთ აქ


let age1 = prompt("შეიყვანე შენი ასაკი");
let message;

message = age1 >= 16 ? 'შეგიძლია მანქანის მართვა.' : 'არ შეგიძლია მანქანის მართვა';

console.log(message);

// ამ დავალებისთვის სხვა კოდი მოვიფიქრე რადგან წინა კოდის ტერნერში გადმოყვანა გამიჭირდა, 
// თან მაგხელა კოდის დაწერე if/if else/else statement-ით უფრო რეკომენდირებულია როგორც ვიცი :)

//



/*
  ჩვენ გვაქვს ოთხი ფერი რომელთაც აქვთ
  კონკრეტული ციფრები მინიჭებული (თეთრი=4, 
  წითელი=3, მწვანე=2, ლურჯი=1, შავი=0, 
  სხვა ყველა ფერი=undefinde)
*/

let colorId = 3

// დაწერეთ if ისე, რომ როდესაც ჩვენ
// შევცვლით მაღლა განსაზღვრულ ცვლადს გავიგოთ
// ამ აიდის ფერი (ფერი გამოიტანეთ კონსოლში ტექსტის
// სახით)


// >>> კოდი დაწერეთ აქ


if(colorId == 0){
  console.log("ეს ფერი არის შავი")
    }else if(colorId == 1){
      console.log("ეს ფერი არის ლურჯი")
        }else if(colorId == 2){
          console.log("ეს ფერი არის მწვანე")
            }else if(colorId == 3){
              console.log("ეს ფერი არის წითელი")
                }else if(colorId == 4){
                  console.log("ეს ფერი არის თეთრი")
}





//



// გადაიყვანეთ If ternary operator-ში მაგ. (true ? 1 : 2) 

// >>> კოდი დაწერეთ აქ

// (colorId != 0) ? (colorId != 1) ? (colorId != 2) ? (colorId != 3) ? (colorId != 4) ? console.log("ეს ფერი არის თეთრი") : console.log("ეს ფერი არის თეთრი") : console.log("ეს ფერი არის მწვანე") : console.log("ეს ფერი არის ლურჯი") : console.log("ეს ფერი არის შავი");

//  ვიცი რაღაც ერორი მაქ დროის გამო ვერ ვასწრებ რომ დავფიქსო
//  დავაკომენტარე რადგან ერორს მიგდებს და იყოს ასე


// <------- დავალება Switch ---------#### //

// ცადეთ იგივე გააკეთოთ რაც წინა დავალებაში
// ოღონდ ამჯერად Switch-ის დახმარებით


// >>> კოდი დაწერეთ აქ

switch(colorId){
    case 0: 
      console.log("ეს ფერი არის შავი");
      break;
    case 1: 
      console.log("ეს ფერი არის ლურჯი")
      break;
    case 2:
      console.log("ეს ფერი არის მწვანე")
      break;
    case 3:
      console.log("ეს ფერი არის წითელი")
      break;
    case 4: 
      console.log("ეს ფერი არის თეთრი")
      break;
    default: 
      console.log("არვიცი რომელი ფერია ეს")
}


//



//  ||
//  ||
//  ||
// \  /
//  \/

/*
    ეს დავალება რომ ნახოთ გამოიყენეთ HTML,
    ჩვენი მიზანია ავაწყოთ ჩეთ ბოტი რომელთანაც ვისაუბრებთ
    როგორც ხედავთ დაბლა გამზადებული მაქვს კოდის გარკვეული
    ნაწილი ეს არის ფუნქცია რომელსაც მომავალში გავივლით
    კონკრეტულად ეს ფუნქცია არის რეკურსიული, რეკურსია
    არის პროცესი როდესაც ფუნქცია თავის თავს იძახებს ჩვენ კი
    იმიტომ ვიყენებთ ამას, რომ ყოველ ჯერზე როდესად რაღაცის თქმა
    დაგვჭირდება მზად იყოს სასაუბროდ ჩვენი ბოტი

    // კოდში მოათავსეთ Switch რომლითაც დააპროგნოზებთ სასაუბრო
    // სიტყვებს ააწყობთ მინი ჩათ ბოტს.
    მაგ. 
    """"
      case "გამარჯობა":
        alert("გამარჯობა");
        break;
    """"
*/
const bot = document.getElementById("bot")
bot.addEventListener("click", myFun())

function myFun() {
  let x = prompt("მე მზად არ ვარ პასუხისათვის");

  // >>> კოდი დაწერეთ აქ გამოიყენეთ Switch
   
  switch(x){
    case "მოგესალმები":
      alert("hey bro")
      break;
    case "როგორ მიდის საქმეები?":
      alert("ჯერჯერობით ნორმალურად")
      break;
    case "ძალიან კარგი კურსია, ხო მეთანხმები?":
      alert("კი ლუკას და ლოვას დამსახურებაა")
      break;
    case "წავედი ახლა გავგზავნო დავალება თორე დედლინს გადავაცილე":
      alert("წარმატებები <3")
      break;

    
  }

  //

  // რეკურსიული ფუნქცია
  myFun()
}